{
  "title": "a11y Checklist",
  "sections": [
    {
      "title": "Content",
      "description": "Content is the most important part of your site.",
      "link": "https://www.a11yproject.com/checklist/#content",
      "items": [
        {
          "id": "content-plain-language",
          "text": "Use plain language and avoid figures of speech, idioms, and complicated metaphors.",
          "wcag": "3.1.5 Reading Level",
          "longDescription": "Write content at an 8th grade reading level."
        },
        {
          "id": "content-unique-labels",
          "text": "Make sure that button, a, and label element content is unique and descriptive.",
          "wcag": "1.3.1 Info and Relationships",
          "longDescription": "Terms like \"click here\" and \"read more\" do not provide any context. Some people navigate using a list of all buttons or links on a page or view. When using this mode, the terms indicate what will happen if navigated to or activated."
        },
        {
          "id": "content-ltr-rtl",
          "text": "Use left-aligned text for left-to-right (LTR) languages, and right-aligned text for right-to-left (RTL) languages.",
          "wcag": "1.4.8 Visual Presentation",
          "longDescription": "Centered-aligned or justified text is difficult to read."
        }
      ]
    },
    {
      "title": "Global code",
      "description": "Global code is code that affects your entire website or web app.",
      "link": "https://www.a11yproject.com/checklist/#global-code",
      "items": [
        {
          "id": "global-validate-html",
          "text": "Validate your HTML.",
          "wcag": "4.1.1 Parsing",
          "longDescription": "Valid HTML helps to provide a consistent, expected experience across all browsers and assistive technology."
        },
        {
          "id": "global-lang-attribute",
          "text": "Use a lang attribute on the html element.",
          "wcag": "3.1.1 Language of Page",
          "longDescription": "This helps assistive technology such as screen readers to pronounce content correctly."
        },
        {
          "id": "global-title-unique",
          "text": "Provide a unique title for each page or view.",
          "wcag": "2.4.2 Page Titled",
          "longDescription": "The title element, contained in the document's head element, is often the first piece of information announced by assistive technology. This helps tell people what page or view they are going to start navigating."
        },
        {
          "id": "global-viewport-zoom",
          "text": "Ensure that viewport zoom is not disabled.",
          "wcag": "1.4.4 Resize text",
          "longDescription": "Some people need to increase the size of text to a point where they can read it. Do not stop them from doing this, even for web apps with a native app-like experience. Even native apps should respect Operating System settings for resizing text."
        },
        {
          "id": "global-landmark-elements",
          "text": "Use landmark elements to indicate important content regions.",
          "wcag": "4.1.2 Name, Role, Value",
          "longDescription": "Landmark regions help communicate the layout and important areas of a page or view, and can allow quick access to these regions. For example, use the nav element to wrap a site's navigation, and the main element to contain the primary content of a page."
        },
        {
          "id": "global-linear-flow",
          "text": "Ensure a linear content flow.",
          "wcag": "2.4.3 Focus Order",
          "longDescription": "Remove tabindex attribute values that aren't either 0 or -1. Elements that are inherently focusable, such as links or button elements, do not require a tabindex. Elements that are not inherently focusable should not have a tabindex applied to them outside of very specific use cases."
        },
        {
          "id": "global-no-autofocus",
          "text": "Avoid using the autofocus attribute.",
          "wcag": "2.4.3 Focus Order",
          "longDescription": "People who are blind or who have low vision may be disoriented when focus is moved without their permission. Additionally, autofocus can be problematic for people with motor control disabilities, as it may create extra work for them to navigate out from the autofocused area and to other locations on the page/view."
        },
        {
          "id": "global-extend-session",
          "text": "Allow extending session timeouts.",
          "wcag": "2.2.1 Timing Adjustable",
          "longDescription": "If you cannot remove session timeouts altogether, then let the person using your site easily turn off, adjust, or extend their session well before it ends."
        },
        {
          "id": "global-remove-title-tooltips",
          "text": "Remove title attribute tooltips.",
          "wcag": "4.1.2 Name, Role, Value",
          "longDescription": "The title attribute has numerous issues, and should not be used if the information provided is important for all people to access. An acceptable use for the title attribute would be labeling an iframe element to indicate what content it contains."
        }
      ]
    },
    {
      "title": "Keyboard",
      "description": "It is important that your interface and content can be operated, and navigated by use of a keyboard. Some people cannot use a mouse, or may be using other assistive technologies that may not allow for hovering or precise clicking.",
      "link": "https://www.a11yproject.com/checklist/#keyboard",
      "items": [
        {
          "id": "keyboard-focus-style",
          "text": "Make sure there is a visible focus style for interactive elements that are navigated to via keyboard input.",
          "wcag": "2.4.7 Focus Visible",
          "longDescription": "Can a person navigating with a keyboard, switch, voice control, or screen reader see where they currently are on the page?"
        },
        {
          "id": "keyboard-focus-order",
          "text": "Check to see that keyboard focus order matches the visual layout.",
          "wcag": "1.3.2 Meaningful Sequence",
          "longDescription": "Can a person navigating with a keyboard or screen reader move around the page in a predictable way?"
        },
        {
          "id": "keyboard-remove-invisible",
          "text": "Remove invisible focusable elements.",
          "wcag": "2.4.3 Focus Order",
          "longDescription": "Remove the ability to focus on elements that are not presently meant to be discoverable. This includes things like inactive drop down menus, off screen navigations, or modals."
        }
      ]
    },
    {
      "title": "Images",
      "description": "Images are a very common part of most websites. Help make sure they can be enjoyed by all.",
      "link": "https://www.a11yproject.com/checklist/#images",
      "items": [
        {
          "id": "images-alt-attribute",
          "text": "Make sure that all img elements have an alt attribute.",
          "wcag": "1.1.1 Non-text Content",
          "longDescription": "alt attributes (alt text) give a description of an image for people who may not be able to view them. When an alt attribute isn't present on an image, a screen reader may announce the image's file name and path instead. This fails to communicate the image's content."
        },
        {
          "id": "images-decorative-null-alt",
          "text": "Make sure that decorative images use null alt (empty) attribute values.",
          "wcag": "1.1.1 Non-text Content",
          "longDescription": "Null alt attributes are also sometimes known as empty alt attributes. They are made by including no information between the opening and closing quotes of an alt attribute. Decorative images do not communicate information that is required to understand the website's overall meaning. Historically they were used for flourishes and spacer gif images, but tend to be less relevant for modern websites and web apps."
        },
        {
          "id": "images-complex-alt",
          "text": "Provide a text alternative for complex images such as charts, graphs, and maps.",
          "wcag": "1.1.1 Non-text Content",
          "longDescription": "Is there a plain text which lists points on the map or sections of a flowchart? Describe all visible information. This includes graph axes, data points and labels, and the overall point the graphic is communicating."
        },
        {
          "id": "images-text-alt",
          "text": "For images containing text, make sure the alt description includes the image's text.",
          "wcag": "1.1.1 Non-text Content",
          "longDescription": "For example, the FedEx logo should have an alt value of \"FedEx.\""
        }
      ]
    },
    {
      "title": "Headings",
      "description": "Heading elements (h1, h2, h3, etc.) help break up the content of the page into related \"chunks\" of information. They are incredibly important for helping people who use assistive technology to understand the meaning of a page or view.",
      "link": "https://www.a11yproject.com/checklist/#headings",
      "items": [
        {
          "id": "headings-intro",
          "text": "Use heading elements to introduce content.",
          "wcag": "2.4.6 Headings or Labels",
          "longDescription": "Heading elements construct a document outline, and should not be used for purely visual design."
        },
        {
          "id": "headings-one-h1",
          "text": "Use only one h1 element per page or view.",
          "wcag": "2.4.6 Headings or Labels",
          "longDescription": "The h1 element should be used to communicate the high-level purpose of the page or view. Do not use the h1 element for a heading that does not change between pages or views (for example, the site's name)."
        },
        {
          "id": "headings-logical-sequence",
          "text": "Heading elements should be written in a logical sequence.",
          "wcag": "2.4.6 Headings or Labels",
          "longDescription": "The order of heading elements should descend, based on the \"depth\" of the content. For example, a h4 element should not appear on a page before the first h3 element declaration. A tool such as headingsMap can help you evaluate this."
        },
        {
          "id": "headings-no-skip",
          "text": "Don't skip heading levels.",
          "wcag": "2.4.6 Headings or Labels",
          "longDescription": "For example, don't jump from a h2 to a h4, skipping a h3 element. If heading levels are being skipped for a specific visual treatment, use CSS classes instead."
        }
      ]
    },
    {
      "title": "Lists",
      "description": "Lists elements let people know a collection of items are related and if they are sequential, and how many items are present in the list grouping.",
      "link": "https://www.a11yproject.com/checklist/#lists",
      "items": [
        {
          "id": "lists-semantic",
          "text": "Use list elements (ol, ul, and dl elements) for list content.",
          "wcag": "1.3.1 Info and Relationships",
          "longDescription": "This may include sections of related content, items visually displayed in a grid-like layout, or sibling a elements."
        }
      ]
    },
    {
      "title": "Controls",
      "description": "Controls are interactive elements such as links and buttons that let a person navigate to a destination or perform an action.",
      "link": "https://www.a11yproject.com/checklist/#controls",
      "items": [
        {
          "id": "controls-a-element",
          "text": "Use the a element for links.",
          "wcag": "1.3.1 Info and Relationships",
          "longDescription": "Links should always have a href attribute, even when used in Single Page Applications (SPAs). Without a href attribute, the link will not be properly exposed to assistive technology. An example of this would be a link that uses an onclick event, in place of a href attribute."
        },
        {
          "id": "controls-links-recognizable",
          "text": "Ensure that links are recognizable as links.",
          "wcag": "1.4.1 Use of Color",
          "longDescription": "Color alone is not sufficient to indicate the presence of a link. Underlines are a popular and commonly-understood way to communicate the presence of link content."
        },
        {
          "id": "controls-focus-states",
          "text": "Ensure that controls have :focus states.",
          "wcag": "2.4.7 Focus Visible",
          "longDescription": "Visible focus styles help people determine which interactive element has keyboard focus. This lets them know that they can perform actions like activating a button or navigating to a link's destination."
        },
        {
          "id": "controls-button-element",
          "text": "Use the button element for buttons.",
          "wcag": "1.3.1 Info and Relationships",
          "longDescription": "Buttons are used to submit data or perform an on-screen action which does not shift keyboard focus. You can add type=\"button\" to a button element to prevent the browser from attempting to submit form information when activated."
        },
        {
          "id": "controls-skip-link",
          "text": "Provide a skip link and make sure that it is visible when focused.",
          "wcag": "2.4.1 Bypass Blocks",
          "longDescription": "A skip link can be used to provide quick access to the main content of a page or view. This allows a person to easily bypass globally repeated content such as a website's primary navigation, or persistent search widget."
        },
        {
          "id": "controls-new-tab",
          "text": "Identify links that open in a new tab or window.",
          "wcag": "G201: Giving users advanced warning when opening a new window",
          "longDescription": "Ideally, avoid links that open in a new tab or window. If a link does, ensure the link's behavior will be communicated in a way that is apparent to all users. Doing this will help people understand what will happen before activating the link. While this technique is technically not required for compliance, it is an often-cited area of frustration for many different kinds of assistive technology users."
        }
      ]
    },
    {
      "title": "Tables",
      "description": "Tables are a structured set of data that help people understand the relationships between different types of information.",
      "link": "https://www.a11yproject.com/checklist/#tables",
      "items": [
        {
          "id": "tables-table-element",
          "text": "Use the table element to describe tabular data.",
          "wcag": "1.3.1 Info and Relationships",
          "longDescription": "Do you need to display data in rows and columns? Use the table element."
        },
        {
          "id": "tables-th-element",
          "text": "Use the th element for table headers (with appropriate scope attributes).",
          "wcag": "4.1.1 Parsing",
          "longDescription": "Depending on how complex your table is, you may also consider using scope=\"col\" for column headers, and scope=\"row\" for row headers. Many different kinds of assistive technology still use the scope attribute to help them understand and describe the structure of a table."
        },
        {
          "id": "tables-caption-element",
          "text": "Use the caption element to provide a title for the table.",
          "wcag": "2.4.6 Headings or Labels",
          "longDescription": "The table's caption should describe what kind of information the table contains."
        }
      ]
    },
    {
      "title": "Forms",
      "description": "Forms allow people to enter information into a site for processing and manipulation. This includes things like sending messages and placing orders.",
      "link": "https://www.a11yproject.com/checklist/#forms",
      "items": [
        {
          "id": "forms-labels",
          "text": "All inputs in a form are associated with a corresponding label element.",
          "wcag": "3.2.2 On Input",
          "longDescription": "Use a for/id pairing to guarantee the highest level of browser/assistive technology support."
        },
        {
          "id": "forms-fieldset-legend",
          "text": "Use fieldset and legend elements where appropriate.",
          "wcag": "1.3.1 Info and Relationships",
          "longDescription": "Does your form contain multiple sections of related inputs? Use fieldset to group them, and legend to provide a label for what this section is for."
        },
        {
          "id": "forms-autocomplete",
          "text": "Inputs use autocomplete where appropriate.",
          "wcag": "1.3.5 Identify Input Purpose",
          "longDescription": "Providing a mechanism to help people more quickly, easily, and accurately fill in form fields that ask for common information (for example, name, address, phone number)."
        },
        {
          "id": "forms-errors-list",
          "text": "Make sure that form input errors are displayed in list above the form after submission.",
          "wcag": "3.3.1 Error Identification",
          "longDescription": "This provides a way for assistive technology users to quickly have a high-level understanding of what issues are present in the form. This is especially important for larger forms with many inputs. Make sure that each reported error also has a link to the corresponding field with invalid input."
        },
        {
          "id": "forms-errors-associated",
          "text": "Associate input error messaging with the input it corresponds to.",
          "wcag": "3.3.1 Error Identification",
          "longDescription": "Techniques such as using aria-describedby allow people who use assistive technology to more easily understand the difference between the input and the error message associated with it."
        },
        {
          "id": "forms-not-color-only",
          "text": "Make sure that error, warning, and success states are not visually communicated by just color.",
          "wcag": "1.4.1 Use of Color",
          "longDescription": "People who are color blind, who have other low vision conditions, or different cultural understandings for color may not see the state change, or understand what kind of feedback the state represents if color is the only indicator."
        }
      ]
    },
    {
      "title": "Media",
      "description": "Media includes content such as pre-recorded and live audio and video.",
      "link": "https://www.a11yproject.com/checklist/#media",
      "items": [
        {
          "id": "media-no-autoplay",
          "text": "Make sure that media does not autoplay.",
          "wcag": "1.4.2 Audio Control",
          "longDescription": "Unexpected video and audio can be distracting and disruptive, especially for certain kinds of cognitive disability such as ADHD. Certain kinds of autoplaying video and animation can be a trigger for vestibular and seizure disorders."
        },
        {
          "id": "media-controls-markup",
          "text": "Ensure that media controls use appropriate markup.",
          "wcag": "1.3.1 Info and Relationships",
          "longDescription": "Examples include making sure an audio mute button has a pressed toggle state when active, or that a volume slider uses <input type=\"range\">."
        },
        {
          "id": "media-can-be-paused",
          "text": "Check to see that all media can be paused.",
          "wcag": "2.1.1 Keyboard",
          "longDescription": "Provide a global pause function on any media element. If the device has a keyboard, ensure that pressing the Space key can pause playback. Make sure you also don't interfere with the Space key's ability to scroll the page/view when not focusing on a form control."
        }
      ]
    },
    {
      "title": "Video",
      "description": "Video-specific checks.",
      "link": "https://www.a11yproject.com/checklist/#video",
      "items": [
        {
          "id": "video-captions",
          "text": "Confirm the presence of captions.",
          "wcag": "1.2.2 Captions",
          "longDescription": "Captions allow a person who cannot hear the audio content of a video to still understand its content."
        },
        {
          "id": "video-remove-seizure",
          "text": "Remove seizure triggers.",
          "wcag": "2.3.1 Three Flashes or Below Threshold",
          "longDescription": "Certain kinds of strobing or flashing animations will trigger seizures."
        }
      ]
    },
    {
      "title": "Audio",
      "description": "Audio-specific checks.",
      "link": "https://www.a11yproject.com/checklist/#audio",
      "items": [
        {
          "id": "audio-transcripts",
          "text": "Confirm that transcripts are available.",
          "wcag": ""
        }
      ]
    },
    {
      "title": "Appearance",
      "description": "How your website app content looks in any given situation.",
      "link": "https://www.a11yproject.com/checklist/#appearance",
      "items": [
        {
          "id": "appearance-specialized-modes",
          "text": "Check your content in specialized browsing modes.",
          "wcag": "1.4.1 Use of Color",
          "longDescription": "Activate modes such as Windows High Contrast or Inverted Colors. Is your content still legible? Are your icons, borders, links, form fields, and other content still present? Can you distinguish foreground content from the background?"
        },
        {
          "id": "appearance-increase-text",
          "text": "Increase text size to 200%.",
          "wcag": "1.4.4 Resize text",
          "longDescription": "Is the content still readable? Does increasing the text size cause content to overlap?"
        },
        {
          "id": "appearance-proximity",
          "text": "Double-check that good proximity between content is maintained.",
          "wcag": "1.3.3 Sensory Characteristics",
          "longDescription": "Use the straw test to ensure people who depend on screen zoom software can still easily discover all content."
        },
        {
          "id": "appearance-not-color-only",
          "text": "Make sure color isn't the only way information is conveyed.",
          "wcag": "1.4.1 Use of Color",
          "longDescription": "Can you still see where links are among body content if everything is grayscale?"
        },
        {
          "id": "appearance-not-visual-audio-only",
          "text": "Make sure instructions are not visual or audio-only.",
          "wcag": "1.3.3 Sensory Characteristics",
          "longDescription": "Use a combination of characteristics to write cues, particularly the actual names of sections and elements, rather than just descriptions like location (\"on the right\") or audio (\"after the tone\")."
        },
        {
          "id": "appearance-simple-layout",
          "text": "Use a simple, straightforward, and consistent layout.",
          "wcag": "1.4.10 Reflow",
          "longDescription": "A complicated layout can be confusing to understand and use."
        }
      ]
    },
    {
      "title": "Animation",
      "description": "Content that moves, either on its own, or when triggered by a person activating a control.",
      "link": "https://www.a11yproject.com/checklist/#animation",
      "items": [
        {
          "id": "animation-subtle",
          "text": "Ensure animations are subtle and do not flash too much.",
          "wcag": "2.3.1 Three Flashes or Below Threshold",
          "longDescription": "Certain kinds of strobing or flashing animations will trigger seizures. Others may be distracting and disruptive, especially for certain kinds of cognitive disability such as ADHD."
        },
        {
          "id": "animation-pause-bg-video",
          "text": "Provide a mechanism to pause background video.",
          "wcag": "2.2.2 Pause, Stop, Hide",
          "longDescription": "Background video can be distracting, especially if content is placed over it."
        },
        {
          "id": "animation-reduced-motion",
          "text": "Make sure all animation obeys the prefers-reduced-motion media query.",
          "wcag": "2.3.3 Animation from Interactions",
          "longDescription": "Remove animations when the \"reduce motion\" setting is activated. If an animation is necessary to communicate meaning for a concept, slow its duration down."
        }
      ]
    },
    {
      "title": "Color contrast",
      "description": "Color contrast is how legible colors are when placed next to, and on top of each other.",
      "link": "https://www.a11yproject.com/checklist/#color-contrast",
      "items": [
        {
          "id": "color-contrast-normal",
          "text": "Check the contrast for all normal-sized text.",
          "wcag": "1.4.3 Contrast",
          "longDescription": "Level AA compliance requires a contrast ratio of 4.5:1."
        },
        {
          "id": "color-contrast-large",
          "text": "Check the contrast for all large-sized text.",
          "wcag": "1.4.3 Contrast",
          "longDescription": "Level AA compliance requires a contrast ratio of 3:1."
        },
        {
          "id": "color-contrast-icons",
          "text": "Check the contrast for all icons.",
          "wcag": "1.4.11 Non-text Contrast",
          "longDescription": "Level AA compliance requires a contrast ratio of 3.0:1."
        },
        {
          "id": "color-contrast-borders",
          "text": "Check the contrast of borders for input elements (text input, radio buttons, checkboxes, etc.).",
          "wcag": "1.4.11 Non-text Contrast",
          "longDescription": "Level AA compliance requires a contrast ratio of 3.0:1."
        },
        {
          "id": "color-contrast-overlap",
          "text": "Check text that overlaps images or video.",
          "wcag": "1.4.3 Contrast",
          "longDescription": "Is text still legible?"
        },
        {
          "id": "color-contrast-selection",
          "text": "Check custom ::selection colors.",
          "wcag": "1.4.3 Contrast",
          "longDescription": "Is the color contrast you set in your ::selection CSS declaration sufficient? Otherwise someone may not be able read it if they highlight it."
        }
      ]
    },
    {
      "title": "Mobile and touch",
      "description": "Things to check mobile experiences for.",
      "link": "https://www.a11yproject.com/checklist/#mobile-and-touch",
      "items": [
        {
          "id": "mobile-orientation",
          "text": "Check that the site can be rotated to any orientation.",
          "wcag": "1.3.4 Orientation",
          "longDescription": "Does the site only allow portrait orientation?"
        },
        {
          "id": "mobile-no-horizontal-scroll",
          "text": "Remove horizontal scrolling.",
          "wcag": "1.4.10 Reflow",
          "longDescription": "Requiring someone to scroll horizontally can be difficult for some, irritating for all."
        },
        {
          "id": "mobile-activate-icons",
          "text": "Ensure that button and link icons can be activated with ease.",
          "wcag": "2.5.5 Target Size",
          "longDescription": "It's good to make sure things like hamburger menus, social icons, gallery viewers, and other touch controls are usable by a wide range of hand and stylus sizes."
        },
        {
          "id": "mobile-scroll-area",
          "text": "Ensure sufficient space between interactive items in order to provide a scroll area.",
          "wcag": "2.4.1 Bypass Blocks",
          "longDescription": "Some people who experience motor control issues such as hand tremors may have a very difficult time scrolling past interactive items which feature zero spacing."
        }
      ]
    }
  ]
}